docs/examples/DGDS v3/ModifyDangerousGoodsHandlingUnitRequest_v3.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v3="http://fedex.com/ws/dgds/v3">
   <soapenv:Header/>
   <soapenv:Body>
      <v3:ModifyDangerousGoodsHandlingUnitRequest>
         <v3:WebAuthenticationDetail>
            <v3:ParentCredential>
               <v3:Key>INPUT YOUR INFORMATION</v3:Key>
               <v3:Password>INPUT YOUR INFORMATION</v3:Password>
            </v3:ParentCredential>
            <v3:UserCredential>
               <v3:Key>INPUT YOUR INFORMATION</v3:Key>
               <v3:Password>INPUT YOUR INFORMATION</v3:Password>
            </v3:UserCredential>
         </v3:WebAuthenticationDetail>
         <v3:ClientDetail>
            <v3:AccountNumber>INPUT YOUR INFORMATION</v3:AccountNumber>
            <v3:MeterNumber>INPUT YOUR INFORMATION</v3:MeterNumber>
                 <v3:Region>US</v3:Region>
            <v3:Localization>
               <v3:LanguageCode>EN</v3:LanguageCode>
               <v3:LocaleCode>US</v3:LocaleCode>
            </v3:Localization>
         </v3:ClientDetail>
         <v3:TransactionDetail>
            <v3:CustomerTransactionId>ModifyDangerousGoodsHandlingUnit-Express</v3:CustomerTransactionId>
         </v3:TransactionDetail>
         <v3:Version>
            <v3:ServiceId>dgds</v3:ServiceId>
            <v3:Major>3</v3:Major>
            <v3:Intermediate>0</v3:Intermediate>
            <v3:Minor>0</v3:Minor>
         </v3:Version>
         <v3:UploadId>INPUT YOUR INFORMATION</v3:UploadId>
         <v3:HandlingUnitGroup>
            <v3:Id>Group#1</v3:Id>
            <v3:NumberOfHandlingUnits>01</v3:NumberOfHandlingUnits>
            <v3:TrackingNumberUnits>
               <v3:TrackingIds>
                  <v3:TrackingIdType>FEDEX</v3:TrackingIdType>
                  <v3:FormId>0263</v3:FormId>
                  <v3:TrackingNumber>INPUT YOUR INFORMATION</v3:TrackingNumber>
               </v3:TrackingIds>
            </v3:TrackingNumberUnits>
            <v3:HandlingUnit>
               <v3:Attributes>OVERPACK</v3:Attributes>
               <v3:ContainerGroups>
                  <v3:NumberOfIdenticalContainers>1</v3:NumberOfIdenticalContainers>
                  <v3:Container>
                     <v3:ContainerType>Aluminum Boxes</v3:ContainerType>
                     <v3:GrossWeight>
                        <v3:Units>KG</v3:Units>
                        <v3:Value>10</v3:Value>
                     </v3:GrossWeight>
                     <v3:Commodities>
                        <v3:Description>
                           <v3:IdType>UN</v3:IdType>
                           <v3:Id>1845</v3:Id>
                           <v3:SequenceNumber>2</v3:SequenceNumber>
                           <v3:PackingGroup>UNDEFINED</v3:PackingGroup>
                           <v3:PackingInstructions>954</v3:PackingInstructions>
                           <v3:AircraftCategoryType>PASSENGER_AND_CARGO_AIRCRAFT</v3:AircraftCategoryType>
                           <v3:ProperShippingName>Dry ice</v3:ProperShippingName>
                           <v3:PrimaryClass>9</v3:PrimaryClass>
                           <v3:Percentage>0.0</v3:Percentage>
                        </v3:Description>
                        <v3:Quantity>
                           <v3:Amount>1</v3:Amount>
                           <v3:Units>KG</v3:Units>
                        </v3:Quantity>
                     </v3:Commodities>
                  </v3:Container>
               </v3:ContainerGroups>
            </v3:HandlingUnit>
         </v3:HandlingUnitGroup>
      </v3:ModifyDangerousGoodsHandlingUnitRequest>
   </soapenv:Body>
</soapenv:Envelope>


Response:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ModifyDangerousGoodsHandlingUnitReply xmlns="http://fedex.com/ws/dgds/v3">
         <HighestSeverity>SUCCESS</HighestSeverity>
         <Notifications>
            <Severity>SUCCESS</Severity>
            <Source>dgds</Source>
            <Code>000</Code>
            <Message>SUCCESS</Message>
            <LocalizedMessage>SUCCESS</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>ModifyDangerousGoodsHandlingUnit-Express</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>dgds</ServiceId>
            <Major>3</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <CompletedShipmentDetail>
            <Regulation>IATA</Regulation>
            <RegulationAttributes>DRY_ICE_DECLARATION_REQUIRED</RegulationAttributes>
            <TotalHandlingUnitCount>3</TotalHandlingUnitCount>
            <AircraftCategoryType>PASSENGER_AND_CARGO_AIRCRAFT</AircraftCategoryType>
            <DangerousGoodsDescriptors>DRY_ICE</DangerousGoodsDescriptors>
            <Options>HAZARDOUS_MATERIALS</Options>
            <ShipmentDryIceDetail>
               <PackageCount>3</PackageCount>
               <TotalWeight>
                  <Units>KG</Units>
                  <Value>3.0</Value>
               </TotalWeight>
            </ShipmentDryIceDetail>
         </CompletedShipmentDetail>
         <CompletedHandlingUnitGroup>
            <Id>Group#1</Id>
            <NumberOfHandlingUnits>1</NumberOfHandlingUnits>
            <HandlingUnitShippingDetail>
               <TrackingNumberUnits>
                  <TrackingIds>
                     <TrackingIdType>FEDEX</TrackingIdType>
                     <FormId>0263</FormId>
                     <TrackingNumber>INPUT YOUR INFORMATION</TrackingNumber>
                  </TrackingIds>
               </TrackingNumberUnits>
               <AircraftCategoryType>PASSENGER_AND_CARGO_AIRCRAFT</AircraftCategoryType>
               <DangerousGoodsDescriptors>DRY_ICE</DangerousGoodsDescriptors>
               <Options>HAZARDOUS_MATERIALS</Options>
               <DryIceWeight>
                  <Units>KG</Units>
                  <Value>1.0</Value>
               </DryIceWeight>
            </HandlingUnitShippingDetail>
         </CompletedHandlingUnitGroup>
      </ModifyDangerousGoodsHandlingUnitReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


